# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали n журавликов.
# Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

# print('введите сколько корабликов сделали ребята вместе')
# s = int(input())

n = 60
print('Петя и Сережа сделали по', n/6, 'шт')
print('Маша сделала ', n/6*4, 'шт')